Update schema manager architecture doc
